export const frameworks = {
  "①健康知覚・健康管理": {
    "主訴・診断名": [
      "患者の疾患名",
      "患者の現在の調子"
    ],
    "入院目的と経緯": [
      "入院した理由",
      "身体の変化に気づいた時期と出来事",
      "いつ、どのような症状の変化があったか",
      "その症状の原因として思い当たることは何か",
      "その症状に対して行った治療は何か",
      "その症状に対して行った治療の結果はどうだったか"
    ],
    "診断・治療の説明と理解": [
      "医師の説明を本人がどのように解釈しているか",
      "自分ではこれからどうしようと思っているか"
    ],
    "既往歴": [
      "直近1年でいつ、どのような風邪を引いたか",
      "これまで、いつ、どのような大きな病気にかかったのか",
      "これまで病気をしたとき、どう対応してきたか"
    ],
    "薬剤の使用": [
      "疾病に対して服用している薬は何か",
      "服用している薬の目的、服用時間、1回量を知っているか",
      "薬の服用を忘れた場合、身体にどのような異変が出るか。"
    ],
    "入院前の生活習慣": [
      "健康のために気をつけていることは何か",
      "その健康のための行動をどう思っているか",
      "直近1年でいつ転倒転落をしたか"
    ],
    "嗜好品": [
      "飲酒の頻度",
      "喫煙本数と年数",
      "禁煙しているか。していたらいつからしているか"
    ],
    "アレルギー": [
      "何のアレルギーをもっているか"
    ],
    "リスクマネジメント": [
      "肝炎はあるかどうか",
      "していない予防接種はあるか。あるならば、何が未接種か"
    ]
  },
  "②栄養・代謝": {
    "栄養摂取状態": [
      "1日の摂取量、摂取エネルギー",
      "病状に応じてどのような食事内容であるか",
      "1回の食事にかかる時間",
      "どれくらい間食するか",
      "食欲はどれくらいあるか",
      "どのような消化器症状があるか",
      "どのような食事摂取を妨げる要因があるか",
      "どのようなサプリメントを使っているか"
    ],
    "体重・体格": [
      "現在の身長、体重、BMI",
      "体重の変化に異常はあるか。異常があるならどのような体重変化が見られているか",
      "上腕の皮下脂肪厚",
      "腹水・浮腫の有無"
    ],
    "体温": [
      "基礎体温は何度か",
      "1日の体温変化はどのようか"
    ],
    "血液検査データ": [
      "血液検査で異常な項目は何か"
    ],
    "経管・輸液": [
      "経管・輸液の栄養成分、カロリー、水分量はどうなっているか",
      "経管・輸液に関して、どのような問題があるか"
    ],
    "嚥下・口腔状態": [
      "口唇の開閉状態",
      "舌の動きや状態",
      "むせや咳嗽をしているか",
      "歯の健康状態。また、義歯を用いているか",
      "口腔粘膜の状態"
    ],
    "皮膚・爪の状態": [
      "どのような脱水を示唆する所見があるか",
      "創傷、褥瘡の有無",
      "どのような爪の異常が見られるか",
      "ばち指は見られるか"
    ]
  },
  "③排泄": {
    "排尿": [
      "1日の排尿回数、尿量、性状",
      "排尿に関して、どのような問題があるか",
      "尿検査データ",
      "利尿に関連する薬剤の使用状況",
      "尿カテーテルの使用状況"
    ],
    "排便": [
      "1日の排便回数、1回量、性状",
      "便意、腹部膨満感の有無",
      "蠕動運動の状態",
      "排便に関して、どのような問題があるか",
      "排便のADLをFIMで評価すると何点か",
      "下剤の使用状況",
      "排便に使用している器具とその使用状況"
    ],
    "発汗・不感蒸泄": [
      "いつ、どんな状況で発汗しているか",
      "発汗する部位、発汗量"
    ],
    "ドレーンからの排液": [
      "ドレーンの目的の種類",
      "ドレーンに関して、どのような問題があるか",
      "排液の停滞や逆流の有無"
    ]
  }
};  